Revit 2027 API
BuiltInFailures.FamilyFailures.FamilyOverconstraint Property
 Dimension overconstrains the Family. Cannot set Family Type to <None>.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyOverconstraint { get; }
Public Shared ReadOnly Property FamilyOverconstraint As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyOverconstraint {
	FailureDefinitionId^ get ();
}
static member FamilyOverconstraint : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace